; domain
;  (c) 2001 Copyright (c) University of Huddersfield
;  Automatically produced from GIPO from the domain hiking
;  All rights reserved. Use of this software is permitted for non-commercial
;  research purposes, and it may be copied only for that use.  All copies must
;  include this copyright message.  This software is made available AS IS, and
;  neither the GIPO team nor the University of Huddersfield make any warranty about
;  the software or its performance.

(define (domain hiking)
  (:requirements :strips :equality :typing :negative-preconditions)
  (:types car tent person couple place )
  (:predicates 
              (at_tent ?x1 - tent ?x2 - place)
              (at_person ?x1 - person ?x2 - place)
              (at_car ?x1 - car ?x2 - place)
              (partners ?x1 - couple ?x2 - person ?x3 - person)
              (up ?x1 - tent)
              (down ?x1 - tent)
              (walked ?x1 - couple ?x2 - place)
              (next ?x1 - place ?x2 - place)
)

  (:action put_down
         :parameters ( ?x1 - person ?x2 - place ?x3 - tent)
         :precondition (and 
(at_person ?x1 ?x2)(at_tent ?x3 ?x2)(up ?x3))
         :effect (and (down ?x3)(not (up ?x3))
)
)
  (:action put_up
         :parameters ( ?x1 - person ?x2 - place ?x3 - tent)
         :precondition (and 
(at_person ?x1 ?x2)(at_tent ?x3 ?x2)(down ?x3))
         :effect (and (up ?x3)(not (down ?x3))
)
)
  (:action drive_passenger
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car ?x5 - person)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2)(at_person ?x5 ?x2)(not (= ?x1 ?x5)))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
(at_person ?x5 ?x3)(not (at_person ?x5 ?x2))
)
)
  (:action drive
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
)
)
  (:action drive_tent
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car ?x5 - tent)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2)(at_tent ?x5 ?x2)(down ?x5))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
(at_tent ?x5 ?x3)(not (at_tent ?x5 ?x2))
)
)
  (:action drive_tent_passenger
         :parameters ( ?x1 - person ?x2 - place ?x3 - place ?x4 - car ?x5 - tent ?x6 - person)
         :precondition (and 
(at_person ?x1 ?x2)(at_car ?x4 ?x2)(at_tent ?x5 ?x2)(down ?x5)(at_person ?x6 ?x2)(not (= ?x1 ?x6)))
         :effect (and (at_person ?x1 ?x3)(not (at_person ?x1 ?x2))
(at_car ?x4 ?x3)(not (at_car ?x4 ?x2))
(at_tent ?x5 ?x3)(not (at_tent ?x5 ?x2))
(at_person ?x6 ?x3)(not (at_person ?x6 ?x2))
)
)
  (:action walk_together
         :parameters ( ?x1 - tent ?x2 - place ?x3 - person ?x4 - place ?x5 - person ?x6 - couple)
         :precondition (and 
(at_tent ?x1 ?x2)(up ?x1)(at_person ?x3 ?x4)(next ?x4 ?x2)(at_person ?x5 ?x4)(not (= ?x3 ?x5))(walked ?x6 ?x4)(partners ?x6 ?x3 ?x5))
         :effect (and (at_person ?x3 ?x2)(not (at_person ?x3 ?x4))
(at_person ?x5 ?x2)(not (at_person ?x5 ?x4))
(walked ?x6 ?x2)(not (walked ?x6 ?x4))
)
)

)

; problem
(define (problem Hiking-3-20-3)
(:domain hiking)
(:objects 
 car0 car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 - car
 tent0 tent1 tent2 - tent
 couple0 couple1 couple2 - couple
 place0 place1 place2 - place
 guy0 girl0 guy1 girl1 guy2 girl2 - person
)
(:init
(partners couple0 guy0 girl0)
(at_person guy0 place0)
(at_person girl0 place0)
(walked couple0 place0)
(at_tent tent0 place0)
(down tent0)
(partners couple1 guy1 girl1)
(at_person guy1 place0)
(at_person girl1 place0)
(walked couple1 place0)
(at_tent tent1 place0)
(down tent1)
(partners couple2 guy2 girl2)
(at_person guy2 place0)
(at_person girl2 place0)
(walked couple2 place0)
(at_tent tent2 place0)
(up tent2)
(at_car car0 place0)
(at_car car1 place0)
(at_car car2 place0)
(at_car car3 place0)
(at_car car4 place0)
(at_car car5 place0)
(at_car car6 place0)
(at_car car7 place0)
(at_car car8 place0)
(at_car car9 place0)
(at_car car10 place0)
(at_car car11 place0)
(at_car car12 place0)
(at_car car13 place0)
(at_car car14 place0)
(at_car car15 place0)
(at_car car16 place0)
(at_car car17 place0)
(at_car car18 place0)
(at_car car19 place0)
(next place0 place1)
(next place1 place2)
)
(:goal
(and
(walked couple0 place2)
(walked couple1 place2)
(walked couple2 place2)
)
)
)

; plan
1. (drive_tent girl1 place0 place2 car1 tent1)
   deleted: (at_person girl1 place0) (at_car car1 place0) (at_tent tent1 place0)
   added: (at_person girl1 place2) (at_car car1 place2) (at_tent tent1 place2)
   goals met: 0 of 3
2. (put_up girl1 place2 tent1)
   deleted: (down tent1)
   added: (up tent1)
   goals met: 0 of 3
3. (drive_tent girl0 place0 place1 car0 tent0)
   deleted: (at_person girl0 place0) (at_car car0 place0) (at_tent tent0 place0)
   added: (at_person girl0 place1) (at_car car0 place1) (at_tent tent0 place1)
   goals met: 0 of 3
4. (put_up girl0 place1 tent0)
   deleted: (down tent0)
   added: (up tent0)
   goals met: 0 of 3
5. (drive girl1 place2 place0 car1)
   deleted: (at_person girl1 place2) (at_car car1 place2)
   added: (at_person girl1 place0) (at_car car1 place0)
   goals met: 0 of 3
6. (drive girl0 place1 place0 car0)
   deleted: (at_person girl0 place1) (at_car car0 place1)
   added: (at_person girl0 place0) (at_car car0 place0)
   goals met: 0 of 3
7. (walk_together tent0 place1 guy0 place0 girl0 couple0)
   deleted: (at_person guy0 place0) (at_person girl0 place0) (walked couple0 place0)
   added: (at_person guy0 place1) (at_person girl0 place1) (walked couple0 place1)
   goals met: 0 of 3
8. (walk_together tent0 place1 guy1 place0 girl1 couple1)
   deleted: (at_person guy1 place0) (at_person girl1 place0) (walked couple1 place0)
   added: (at_person guy1 place1) (at_person girl1 place1) (walked couple1 place1)
   goals met: 0 of 3
9. (walk_together tent0 place1 guy2 place0 girl2 couple2)
   deleted: (at_person guy2 place0) (at_person girl2 place0) (walked couple2 place0)
   added: (at_person guy2 place1) (at_person girl2 place1) (walked couple2 place1)
   goals met: 0 of 3
10. (walk_together tent1 place2 guy0 place1 girl0 couple0)
   deleted: (at_person guy0 place1) (at_person girl0 place1) (walked couple0 place1)
   added: (at_person guy0 place2) (at_person girl0 place2) (walked couple0 place2)
   goals met: 1 of 3
11. (walk_together tent1 place2 guy1 place1 girl1 couple1)
   deleted: (at_person guy1 place1) (at_person girl1 place1) (walked couple1 place1)
   added: (at_person guy1 place2) (at_person girl1 place2) (walked couple1 place2)
   goals met: 2 of 3
12. (walk_together tent1 place2 guy2 place1 girl2 couple2)
   deleted: (at_person guy2 place1) (at_person girl2 place1) (walked couple2 place1)
   added: (at_person guy2 place2) (at_person girl2 place2) (walked couple2 place2)
   goals met: 3 of 3
